package Labs.Lab9;

public class Pizzeria {
    public static void main(String[] args) {
        Pizza[] pizzas = new Pizza[5];
        pizzas[0] = new Pizza("Карбонара", "сыр моцарелла, бекон, ветчина, помидор черри, " +
                "перепелиное яйцо, соус бальзамико,соус сливочный",
                139.00, 45);
        pizzas[1] = new Pizza("BBQ", "Шашлык, соус BBQ, бекон, грибы, моцарелла, " +
                "перец болгарский, лук, зелень.. ",
                149.00, 33);
        pizzas[2] = new Pizza("Маргарита", "сыр моцарелла, соус сливочный, помидор.. ",
                99.00, 33);
        pizzas[3] = new Pizza("Филадельфия", "Лосось, сыр пармезан, моцарелла,сыр филадельфия, " +
                "маслины, пармезан, салат",
                149.00, 45);
        pizzas[4] = new Pizza("с охотничьими колбаcками", "сыр моцарелла, охотничьи колбаски, " +
                "шашлык, соленый огурец, маслины, лук, соус",
                139.00, 33);
        for (Pizza p : pizzas
             ) {
            System.out.println(p);
        }
    }
}
